The hanger rod was disconnected because there is no structural component above.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricationRodsDisconnectedError { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationRodsDisconnectedError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationRodsDisconnectedError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace